abbreviation
abcs
ability
abing
able
abo
about
above
abroad
absent
accept
accepted
accepting
accident
accidental
accidents
according
acher
achieve
acket
ackpack
across
act
acted
acting
action
actions
activate
active
actively
activities
activity
actor
actors
actress
actually
adam
add
adding
additional
address
aders
adition
adj
adjective
adjectives
admir
admire
admiring
adult
adults
adv
advantage
advantages
adverb
adverbial
adverbs
advertisement
advice
advise
advised
advises
affect
afford
afraid
african
aft
after
afternoon
again
against
agazine
age
agent
ages
ago
agree
agreement
agrees
ahead
ail
ailand
air
airplane
airport
ais
aiwan
ake
akfast
alad
alan
alarm
ale
alent
alex
alexander
alexis
alfred
ali
alice
alien
aliens
alison
alive
alk
all
allow
allowed
almost
alone
along
aloud
alphabet
alphabetical
already
also
although
always
amazing
ame
america
american
americans
amount
ample
amusement
amy
ancestor
ancestors
ancient
and
andbag
anddaughter
andparents
andrew
andy
anger
angrily
angry
animal
animals
anita
ank
anks
anmen
anna
annie
announce
announced
another
ans
answer
answered
answers
ant
antage
anthony
ants
anxi
any
anybody
anymore
anyone
anything
anyway
anywhere
apartment
apescripts
appear
appearance
appeared
appears
apple
apples
appropriate
april
ara
arby
ard
arding
are
area
areas
aren
arge
arks
arm
armful
arms
army
around
arrive
arrived
arrives
art
article
articles
artist
arts
artwork
ash
asia
asian
ask
aske
asked
asking
asks
ass
association
ast
astronaut
ate
ather
ative
ativity
att
attend
attended
attention
attraction
attribute
attributive
august
aunt
australia
australian
autdo
autumn
auty
aux
auxiliary
available
avoid
away
awberry
awful
aww
axed
baby
back
background
backpack
backyard
bad
badly
badminton
bag
bags
bai
balanced
ball
balloon
balloons
balls
bamboo
banana
bananas
band
bank
banker
bar
barry
baseball
baseballs
based
basic
basket
basketball
basketballs
bat
bathroom
bats
battle
bau
baut
bbc
beach
bean
beans
bear
beat
beaten
beautiful
beautifully
beauty
became
because
becky
become
becomes
becoming
bed
bedroom
beds
bedz
beef
been
beethoven
before
began
begin
beginning
begins
begun
behave
behind
beijing
being
beisbo
beisik
bel
belie
believable
believe
believed
believes
bell
belong
below
ben
beri
beriz
berlin
bert
besi
beside
besides
best
bett
better
betty
between
bicycle
bicycles
big
bigger
biggest
biheiv
bike
bikes
biko
bikqz
bil
bili
bill
billy
bin
bins
bird
birth
birthday
birthdays
bisaidz
biscuit
biskit
bit
bite
bizi
bizn
bla
black
blackboard
blank
blanks
blaus
blauz
ble
blender
blew
blind
block
blocks
blonde
blouse
blow
blown
blqk
blu
blue
board
boarding
boat
boating
boats
bob
body
boi
boil
boiling
boiz
bold
boo
book
bookcase
books
bookstore
bore
bored
boring
born
boss
both
bott
bottle
bottom
bought
bout
bow
bowed
bowl
bowls
box
boxes
boy
boys
bqb
bqks
bqr
bqs
bqt
bqtl
bra
brackets
brai
brain
brand
brands
braun
brave
brazil
bre
bread
break
breakfast
bred
brein
brekf
brenda
bri
brian
bridge
bright
bring
bringing
brings
britain
britis
british
britn
broke
broken
brother
brothers
brough
brought
brown
browns
brush
brvd
build
building
buildings
built
buk
bukkeis
buksto
bur
burg
burger
burgers
burial
burn
burned
burning
burnt
bus
buses
busin
business
busy
but
butt
butter
buy
buying
buys
bvt
bvv
bye
cabbage
cake
calendar
cali
call
called
calling
calm
came
camera
camp
camping
can
canada
canadian
cancel
canceled
candies
candles
candy
cannot
cap
capi
capital
car
card
cardinal
cards
care
careful
carefully
careless
cares
caring
carl
carla
carmen
carol
carrot
carrots
carry
cars
carter
cartoon
cartoons
case
cat
catch
cats
caught
cause
caused
causes
causing
cba
cctv
cds
celebrate
celebrated
celebrates
celebrating
celebration
celebrations
celia
cengage
cent
center
central
centuries
century
cer
ceremony
cers
certain
certainly
cha
chain
chair
chalk
challenge
challenges
chance
chances
chang
change
changed
changes
changing
chant
character
characters
charles
chart
charts
cheap
cheaper
cheapest
cheaply
check
cheek
cheer
cheese
chemistry
chen
cheng
chess
chiang
chick
chicken
child
childhood
childr
children
chin
china
chinese
chip
chips
chiu
chocolate
choice
choices
chool
choose
chopst
chopstick
chopsticks
chose
chosen
chr
christmas
cil
cindy
cinema
cinemas
cir
circle
cities
citing
city
cket
claire
clara
clark
class
classes
classic
classmate
classmates
classroom
classrooms
claus
clauses
clay
cle
clean
cleaned
cleaner
cleaning
clear
clearly
clerk
clock
clocks
close
closes
closest
clothes
clothing
cloud
cloudy
club
clubs
clues
coa
coach
coal
coast
coaster
coat
coats
coco
coff
coffee
coin
cold
collected
collection
college
colombia
colombian
color
colorful
colors
colour
column
columns
com
come
comedies
comedy
comes
comfortable
comfortably
coming
common
communicate
communication
community
compact
comparative
comparatives
compare
comparisons
compete
competing
competition
competitions
competitor
competitors
complement
complete
completed
complex
compound
compounding
computer
computers
concert
conditional
congratulate
conj
conjunction
conjunctions
connect
consequences
consider
considered
contents
context
continue
continued
continues
convenient
conversation
conversations
conversion
cook
cookbook
cooked
cookie
cookies
cooking
cool
coordinate
copy
copyright
cor
corn
cornbread
corner
correct
correctly
cost
costume
cott
cotton
coughed
coughing
could
couldn
countable
countries
country
countryside
couple
courage
course
cousin
cousins
cover
covered
crazy
cre
cream
creased
create
created
creates
creating
creative
creativity
cried
crispy
crowd
crowded
crowds
cruel
crum
cry
crying
cult
culties
cultural
culture
cultvolleyball
cup
cups
curly
custom
customer
customers
customs
cut
cute
cutt
cutting
dad
dai
daily
daireksn
dairekt
daisy
dale
dan
dance
danced
dancer
dancers
dancing
danger
dangerous
danny
dare
dared
dark
date
dates
daughter
daun
daut
dave
david
day
days
daytime
ddress
dead
deal
dealt
dear
december
decide
decided
decides
deciding
decision
decisions
decline
ded
deepest
definite
degree
dei
deil
deili
deivid
delete
deliciou
delicious
delt
dem
demonstrative
den
deng
dennis
denny
dentist
depend
depending
depends
der
derivation
dervish
describe
described
describes
describing
description
descriptions
desk
desks
dessert
desserts
detailed
details
develop
developed
developing
development
dialog
dialogue
diary
dickens
dictionaries
dictionary
did
didn
die
died
dies
dif
diff
diffe
difference
different
diffi
difficult
difik
dig
digri
diks
din
dining
dinner
dinnerbreakfast
dir
direct
direction
directions
directly
director
dirty
dis
disadvantage
disagree
disagrees
disappear
disappoint
disappointed
disbelief
disbili
discover
discovered
discovery
discuss
discusses
discussion
disemb
dish
dishes
dishonest
disiz
disk
diskvv
dislike
dislikes
disn
disney
divaid
divide
divided
dizi
djs
dju
dli
dma
dmai
dnt
doctor
documentaries
documentary
does
doesn
dog
dogs
doing
dollar
dollars
don
done
door
doors
dos
dot
double
doubled
doubt
down
downsides
downstairs
dqg
dqkjumentri
dql
dra
dragon
draiv
drama
dramas
drank
draw
drawing
drawings
drawn
dream
dreamed
dreaming
dreams
dreamt
dres
dress
dressed
dresses
dressing
drew
drink
drinking
drinks
drive
driven
driver
driving
drop
dropped
dropping
drove
drum
drums
drunk
dry
drying
duck
dug
dumpling
dumplings
during
dva
dvbl
dvblju
dvd
dvksn
dvkt
dvz
dza
dze
dzei
dzeimz
dzein
dzeis
dzekt
dzeni
dzenr
dzentlm
dzeri
dzesik
dzest
dzests
dzi
dzia
dziqgr
dzo
dzqn
dzu
dzueisn
dzueit
dzulai
dzvds
each
eacher
eachers
ead
eah
ealthy
eam
ear
earlier
earliest
early
earring
ears
eart
earth
earthquake
easier
easiest
easily
east
easter
eastern
easy
eat
eaten
eater
eating
eats
ecosystem
ect
eden
educate
educated
education
educational
edward
edwin
edzukeit
een
eenage
eenager
eenagers
effort
egg
eggs
eight
eighteen
eighteenth
eighth
eightieth
eighty
eili
eimz
eimziz
eipr
eir
eisn
eit
either
eiti
eitiv
eits
eitt
eizn
eks
elb
elbow
elbows
eld
electricity
electronic
elephants
eleven
eleventh
elevision
eliza
ell
elled
ellow
else
email
embarrassed
embarrassing
emili
emily
emotion
empti
empty
encourage
encouraged
encourages
end
endangered
ended
endin
ending
endings
ends
enemy
energy
engineer
england
english
enib
eniba
enjoy
enjoyable
enjoyed
enjoying
enjoys
ennis
enough
ense
ent
enter
entering
entertainment
ention
entries
entry
environment
environmental
eport
equest
equipment
eraser
erasers
ere
erence
erences
erent
eresa
erhu
eric
erik
ering
ern
ernoon
erquan
err
ers
ese
especially
esponsible
ess
ession
est
estroom
etable
etc
european
eusable
eve
even
evening
evenings
event
events
ever
every
everybody
everyday
everyone
everything
everywhere
evil
evride
evridei
evriwe
evriwer
exactly
exam
examination
examinations
examine
example
examples
exams
excellent
except
exchange
excited
excitement
exciting
exclamations
exclamatory
excuse
exercise
exercises
exercising
expe
expect
expected
expects
expensive
experience
experienced
experiences
expert
explain
explained
explaining
explains
explanation
expr
express
expresses
expressing
expression
expressions
ext
eyes
face
faces
facing
fact
factories
factory
facts
fail
failed
failing
fain
faind
fair
fairy
faiv
fall
fallen
falling
falls
false
fame
families
family
famous
fancy
fang
fantastic
far
farm
farmers
farther
farthest
fasc
fascinating
fast
faster
fastest
fat
father
fathers
fatter
fattest
fault
faund
favorite
favourite
fear
febjueri
febru
february
fed
feed
feel
feeling
feelings
feels
feet
fei
feil
feim
feiv
fell
felt
female
fen
fer
feri
ferris
fes
festival
festivals
festivl
few
fewer
ffic
ffin
field
fif
fift
fifteen
fifteenth
fifth
fiftieth
fifty
fight
fik
fill
film
fin
final
finally
find
finding
finds
fine
finer
finest
finis
finish
finished
finishes
finishing
finning
fins
fir
first
fis
fish
fisherman
fishermen
fishing
fit
five
fix
fixes
fiziks
flags
flash
flew
flight
floor
flower
flowers
flown
flu
fluently
fly
flying
focus
fol
folded
folk
follow
followed
following
foo
food
fool
fooled
foot
football
footballs
for
forehead
foreign
foreigners
forever
forfor
forget
forgetting
forgot
forgotten
fork
forks
form
formation
forms
fortieth
fortunately
forty
forward
fought
found
four
fourteen
fourteenth
fourth
fra
fraidei
france
francisco
frank
free
french
frend
frendsip
frequency
fresh
freshest
fri
friday
fridge
fridz
fried
friedman
friend
friendlier
friendly
friends
friendship
frik
from
front
frqm
fru
fruit
fruits
fteenth
fter
fth
ful
full
fun
functions
fund
funnier
funniest
funny
furniture
further
furthest
future
fvn
gaby
gai
gained
game
games
garden
gate
gave
geim
geit
general
gentleman
gentlemen
geogra
geographic
geography
george
georgetown
german
germany
gerund
ges
get
geti
gets
gett
getting
gfimail
ghost
ghosts
ght
gift
gina
girl
girlfriend
girls
give
given
gives
giving
gla
glad
glass
glasses
glove
gloves
glue
glvv
goal
goals
goddess
gods
goes
gogh
gogo
going
gold
gone
good
goodbye
got
gott
gotten
government
governments
gqdes
gra
grace
grade
grades
gradually
graduate
graduation
graham
grammar
granddaughter
grandfather
grandma
grandmother
grandpa
grandparent
grandparents
grandson
grape
grapes
grass
graund
gravy
gre
great
greatest
greatly
gree
green
greener
greenville
greenwood
greet
greeted
greg
grei
greip
greis
greit
grew
grey
gri
grifin
ground
group
groups
grow
growing
grown
grows
guard
guards
gud
guess
guesses
guest
guests
guided
guitar
guizhou
guo
guy
guys
habi
habit
habits
had
hadn
haha
hai
hair
half
halfway
hall
halloween
hallway
hallways
hamburger
hamburgers
han
hand
handbag
handbags
handed
hands
hang
hanging
hangzhou
happen
happened
happening
happenings
happens
happier
happily
happiness
happy
hard
harder
hardly
hares
harmful
harry
has
hasn
hat
hate
hates
hats
hau
haunted
have
haven
having
hayes
head
heading
headings
headline
headmaster
health
healthier
healthy
hear
heard
hearing
heart
hearts
heat
heavier
heavy
hed
heel
heels
hefei
hei
heiz
hel
held
helen
hello
help
helped
helper
helpfl
helpful
helping
helpless
helps
helti
hemingway
hen
hens
her
here
hero
heroes
hers
herself
hey
hid
hidden
hide
hiding
high
higher
highest
highville
hill
him
himself
hina
hir
his
hist
histo
historian
historians
historical
history
histri
hit
hiya
hiz
hju
hmm
hoa
hoax
hobbies
hobby
hoi
hold
hole
holiday
holidays
holly
hollywood
home
homeless
homes
hometown
homework
honey
hong
honor
honour
hope
hopes
horse
hospital
host
hot
hotel
hott
hottest
hou
hour
hours
house
houses
housewarming
housework
how
however
hqli
hristmas
http
hua
huang
huangguoshu
huaxing
hug
huge
huh
hui
hum
human
humans
humorous
hundred
hundreds
hundredth
hung
hungry
hunt
hurry
hursday
hurt
husband
hutongtian
hvg
ice
ick
ickers
icks
iddle
idea
ideas
idely
identify
identifying
identity
ider
idiom
idioms
idn
idol
ien
iends
ier
ifth
igz
iii
iks
iksept
ikskju
ikspres
ikspresn
ikstseindz
ilektra
ilektris
ilektrqnik
ilev
ill
illness
imagination
imaginative
imagine
imb
ime
imp
imperatives
impolite
importance
important
impossible
improve
improved
improvement
improves
improving
ina
inating
include
including
increase
increased
ind
indeed
indefi
indefinite
index
india
indirect
industry
ine
inexpensive
inferences
inferred
inferring
infi
infinitive
infl
influ
influenza
information
ing
inglis
ingredients
ings
inikspensiv
ink
inkri
insect
insects
insekt
inside
insp
inspiration
inspire
instead
instr
instruction
instructions
instrument
instruments
instrvksn
int
intelidz
intelligent
intentions
inter
interest
interested
interesting
interj
interjection
international
internet
interview
interviewed
interviewer
interviewing
into
intonation
intr
introduce
introducing
introduction
invent
invented
invention
inventions
inventor
invitation
invitations
invite
invited
invites
inviting
ird
ireis
ireiz
irin
iron
irregular
irteen
islike
isn
ist
istmas
italian
italy
item
items
its
ize
jack
jacket
jackets
jacob
jacqueline
jake
james
jane
january
japan
japanese
jason
jcfk
jcyjfk
jean
jeans
jeff
jel
jennifer
jenny
jerry
jes
jessica
jian
jiang
jiangxi
jiaokeshu
jiaoyu
jie
jill
jim
jing
jingjing
job
jobs
joe
joee
john
join
joined
joining
joke
jokes
joking
journey
joy
judson
judy
juice
julia
julie
july
jump
jumped
jun
june
junior
junk
just
kang
karen
kate
kathy
katie
kau
kay
kbo
kdei
keep
keeping
kei
keim
keis
keit
keiti
keits
kelly
kemistri
ken
kept
kevin
key
keyboard
keys
kgraund
kick
kid
kidding
kids
kik
killed
killing
kim
kin
kind
kindness
kinds
king
kis
kiss
kissed
kit
kitchen
kite
kites
kju
kjumentri
kla
kle
klei
kler
klo
klqk
knee
knew
knife
knock
knocking
know
knowing
knowledge
known
knows
koin
kong
kongming
kor
korea
kqnv
kqst
kqstju
kqtn
krai
kraud
kri
krieit
krism
krispi
kru
krvm
ksidentl
ksin
ksiz
kspens
kst
ktiv
ktli
ktr
kuki
kung
kvl
kvm
kvmz
kvp
kvridz
kvst
kvzn
kwest
kwests
kwi
kwilt
lab
laboratory
lace
lackboard
ladies
lady
lai
laibr
laibreri
laid
laiflqn
laiftaim
laik
lain
laisns
lait
laitli
laiv
laivli
lake
lan
land
landed
landing
language
languages
lant
lantern
lanterns
lar
large
larry
last
lastly
late
lately
later
latest
lative
laud
laugh
laughing
laughs
laura
lausanne
law
laws
lay
laysian
lazier
lazy
lbag
lead
leader
leaders
leading
leaf
learn
learned
learner
learners
learning
learns
learnt
least
leave
leaves
leaving
leblanc
lect
led
lee
left
leg
legs
lei
leid
leidi
lein
leit
leitli
lem
lemon
len
lend
lent
les
lesn
less
lesson
lessons
let
lett
letter
letters
letting
lettuce
level
levl
lfrid
liaison
libo
library
licence
license
lidz
lie
lies
life
lifelong
lifetime
lift
light
lighted
lights
ligz
like
liked
likes
lili
limpiks
lin
lind
linda
line
lines
ling
lingling
link
linking
lion
lions
liriks
lis
lisa
lisiz
list
listed
listen
listened
listener
listening
listens
lists
liszt
lit
litt
litter
littering
little
liu
live
lived
lively
lives
living
liz
lju
llow
llowed
lmed
lms
local
lock
london
lonely
long
longer
longest
loo
look
looked
looking
looks
lopez
lose
losing
lost
lot
lots
loud
louder
loudest
loudly
love
loved
lovely
loves
low
lower
lowing
lqg
lqk
lqn
lqst
lst
ltd
lti
luck
luckiest
luckily
lucky
lucy
luen
luence
luk
luke
lunch
lver
lvmbi
lvnts
lvv
lways
lweiz
lying
lyrics
macao
machine
mad
made
magazine
magazines
magic
magician
magicians
mai
maik
mail
mails
main
mainly
make
maker
makes
making
malaysia
malaysian
male
mall
man
manage
manager
manner
manners
manson
many
map
mapping
maps
mar
marc
march
marcus
maria
marie
mario
mark
market
marley
married
marry
mars
martha
mary
maryg
mashed
master
masters
match
matches
material
materials
math
mathematics
maths
matt
matter
may
maybe
mayor
meal
meals
mean
meaning
meaningless
meanings
means
meant
meat
medical
medicine
medikl
meet
meeting
meets
mei
meil
meiping
meit
meksik
mem
members
memor
memories
memorize
memorizing
memory
men
meng
mensn
mention
mentioned
menu
meri
meriz
mess
message
messages
met
metal
method
methods
metl
mexico
mfl
michael
mickey
mid
middle
midl
midnight
midsummer
midsvm
might
mike
mil
mile
miles
milk
miller
million
mills
mily
min
mind
mine
mineisn
ming
mingming
minist
minister
minnie
minute
minutes
miracle
mirror
misiz
miss
missed
missing
mist
mistake
mistaken
mistakes
mistook
mistri
mix
miz
mju
mmeit
mmm
mobile
modal
model
modern
molly
mom
moment
mon
monday
mondays
money
month
months
moon
mooncake
mooncakes
mor
more
morning
morton
most
mother
mothermichael
mothers
mount
mountain
mountains
mouse
mouth
mov
move
moved
movie
movies
moving
mozart
mpet
mpetit
mpju
mpli
mpty
mqdl
mqm
mrs
much
mulan
mum
museum
museums
music
musical
musician
musicians
must
mvd
mvndei
mvnt
mvst
mvts
myself
mysteries
mysterious
mystery
nain
naint
nais
naismith
nait
nally
name
named
names
nancy
nanjing
napkin
napkins
narrate
national
nations
natural
nature
nau
nauns
nba
ndb
ndi
ndo
nds
ndz
near
nearby
nearest
nearly
necessary
ned
need
needed
needs
negative
neidi
neidz
neighbor
neighborhood
neim
neismit
neither
nekst
nekt
nelly
ner
neri
nervous
nest
never
new
newest
news
newspaper
newspapers
next
nfa
ngr
nice
nicely
nicest
nick
nidz
night
nik
nin
nine
nineteen
nineteenth
ninetieth
ninety
ning
ninth
nir
nirli
nish
nished
nite
nition
nitive
nitives
nju
njueri
nke
nkeik
nkf
nks
nma
nmentl
nmvd
nobody
nod
nodded
noise
noises
noisy
noiz
none
nong
noodles
noon
nor
normal
normally
north
northern
norway
nose
not
note
notebook
notes
nothing
notice
notices
noting
noun
nouns
nov
novel
november
now
npa
npe
nper
nqd
nqk
nqlidz
nqt
nqvl
nri
nsect
nsest
nsisk
nsl
nsleit
nspo
nted
ntid
ntidz
ntifik
ntion
nts
nty
num
numbe
number
numbers
numeral
numerals
nunan
nvenient
nvi
nvmb
nvnsieisn
oax
object
objective
objects
obligations
ocean
ock
october
oday
odd
oddess
oduce
off
offer
offered
office
officer
oft
often
oice
old
older
oldest
olds
ollar
olympic
olympics
omas
ome
ommy
omorrow
once
one
ones
oneself
ong
onion
online
only
onto
onversation
ony
ood
ook
oom
oor
open
opened
opening
opens
opera
operas
opinion
opinions
ople
opposite
opposites
opyright
orange
oranges
ord
order
ordered
ordering
ordinal
organise
organization
organizations
organize
ork
orson
ort
ose
oshi
other
others
ouch
ough
ound
oung
our
ours
ourselves
out
outdoor
outdoors
outgoing
outside
outstanding
ove
oven
over
overcame
overcome
overcoming
overnight
oversleep
overslept
overweight
ower
owers
own
owner
ownership
oys
pack
packed
page
pai
paid
pain
painful
paint
painted
painting
paintings
paints
pair
pairs
pal
palace
pale
pals
pam
panda
pang
paper
paragliding
paragraph
paragraphs
pardon
parent
parents
park
parking
parks
part
participle
parties
partner
parts
party
pass
passage
passages
passed
passive
passport
past
patient
pattern
patterns
pau
paul
paula
paund
pause
pauses
pay
paying
peace
peaceful
peach
pear
pears
peel
peil
pein
peinfl
peisnt
peking
pen
penang
penc
pencil
pencils
peng
penguins
pengwinz
pens
pensl
people
pep
pepper
per
percent
percentages
perfect
perform
performed
performer
performers
performing
perhaps
perhero
perience
period
permission
person
personal
personality
pet
peter
pets
phone
phoned
phones
phot
photo
photos
phrase
phrases
phy
physical
physics
pianist
piano
picasso
picked
picnic
picnics
picture
pictures
pie
piece
pieces
pierce
pierced
pig
pigs
pik
pika
piknik
pikts
pillow
pilot
ping
pink
pinpa
pinpqn
pioneer
pioneers
piri
pirs
piti
pitl
pity
pjul
pkin
place
places
plan
plane
planes
planet
planets
planned
planners
planning
plans
plant
planted
plants
plastic
plate
play
played
player
players
playing
plays
ple
plea
please
pleasure
plei
plein
plenti
plenty
plez
pli
plural
plurals
poem
poin
point
points
police
policeman
policemen
polish
polished
polite
politely
pollute
polluted
pollution
pong
pool
poor
pop
popcorn
popular
popularity
population
position
positive
possessive
possible
possibly
post
postcard
postcards
poster
postman
pot
potato
potatoes
pound
pounds
pour
power
pqlis
pqpjul
pra
practice
practicing
praid
praim
prais
praise
praiv
praud
pre
predicate
predicative
prediction
predictions
prefer
preferences
prefers
prefixes
preiz
prep
preparation
preparations
prepare
prepared
preparing
preposition
prepositions
present
president
press
pressure
prett
pretty
prevent
prezid
preznt
pri
price
prices
pride
prif
primary
prime
print
private
privent
prize
pro
probably
problem
problems
process
processing
produce
produced
produces
product
products
professional
program
programme
programmer
programs
progress
progressive
project
promise
promises
pron
pronoun
pronounce
pronounced
pronouns
pronunciation
proper
properly
protect
protecting
protection
proud
provide
province
prqdvkt
prqdzekt
pst
pstik
pte
public
publication
publisher
pul
pull
pulled
pumpkin
punish
punished
purp
purple
purpose
put
putt
putting
pvblik
pvn
pvnis
qfis
qin
qingdao
qiwn
qkt
qrindz
qstreili
qualities
quality
quantities
quarrel
quay
queen
question
questioned
questioning
questions
quick
quickly
quiet
quieter
quietest
quietly
quilt
quite
quiz
rabbit
rabbits
race
races
rade
radio
rain
raining
rains
rainy
rais
raise
rait
raiz
ran
rance
rang
rank
rather
rea
reach
reaches
reaction
read
reader
reading
readings
reads
ready
real
realize
realized
realizes
really
reason
reasons
recall
receive
received
receives
recent
recently
recipe
recognize
recognizing
record
recorded
recycle
recycling
red
refer
refl
reflected
refusal
refuse
refused
refusing
region
regret
regular
reidi
reisn
reit
reiz
reksn
rekt
rel
related
relationship
relationships
relative
relatives
relax
relaxed
relaxing
relief
remain
remained
remains
remember
remembered
remembers
remind
reminds
rent
repeat
repeating
replace
replied
reply
report
reported
reporter
reproduced
request
requests
require
research
resolution
resolutions
responses
responsible
rest
restaurant
restaurants
restroom
restrooms
restru
result
results
retell
rethink
return
returned
reusable
reuse
review
reviewing
rewrite
rface
rhu
rhyme
rhythm
ria
rice
rich
rick
ridden
ride
rides
riding
ridz
riences
riflekt
right
rigret
rikl
riko
rikwai
rikwest
ril
rili
rimein
rin
rindz
ring
rings
ripi
rise
risen
risi
rising
rispa
rispqns
rit
rita
rived
river
rivju
riz
rmative
rmth
rnu
road
robert
robinson
robot
robots
rock
rocket
rockets
rockin
rocks
rode
rodrigo
roi
role
roles
roller
room
rooms
rose
round
row
rowling
rown
rows
roy
rseisn
rst
rubbish
ruby
rude
rule
ruler
rules
run
rung
runner
running
runs
rush
rushed
russian
rvn
rvs
sad
sadder
sadness
safe
safety
sai
said
saikl
sail
sain
saint
salad
salads
sale
sally
salt
salty
sam
same
san
sandwich
sandy
sang
santa
sanya
sarah
sat
sato
saturday
saturdays
sau
saund
save
saved
saves
saving
saw
say
saying
sayings
says
scared
scary
schedule
schoo
school
schoolbag
schoolbags
schools
schoolteacher
schoolwork
science
scienti
scientifi
scientific
scientist
scientists
scissors
scoop
score
scores
scoring
scott
screen
screens
scrooge
sea
seafood
search
searched
season
seat
seats
second
secret
section
see
seeds
seeing
seem
seemed
seems
seen
sees
sei
seifti
seil
seim
seint
seisn
sek
sel
seld
seldom
self
selibreisn
sell
sells
send
senior
sens
sense
sensed
sent
sentence
sentences
sentr
sep
separate
septemb
september
sequence
ser
serious
seriously
servant
servants
serve
served
serves
service
serving
set
seven
seventeen
seventeenth
seventh
seventieth
seventy
several
sevn
sfl
shake
shaken
shaking
shall
shan
shandong
shanghai
shape
shaped
shapes
share
sharing
shark
sharks
she
sheep
sheet
shen
sheridan
sherman
shermen
shine
shines
ships
shirley
shirt
shirts
sho
shocked
shoe
shoes
shone
shook
shooting
shop
shopping
shops
short
shorter
shortest
shorts
shot
should
shoulder
shoulders
shouldn
shout
shouted
shouting
show
showed
shower
showing
shown
shows
shut
shy
shyest
shyness
side
sides
sign
siks
silent
silk
silly
silv
silver
simi
similar
simple
simplification
simply
sin
since
sindi
sineitin
sing
singapore
singer
singers
singing
sings
sist
sister
sit
sitcom
sitcoms
situation
situations
six
sixteen
sixteenth
sixth
sixtieth
sixty
siz
sju
skating
skies
skills
skirt
skirts
skit
skitbo
sko
skru
sku
sky
sleep
sleeping
sleepy
slept
sli
slow
slower
slowest
slowly
small
smaller
smart
smarter
smeit
smel
smell
smelled
smelt
smiled
smiles
smit
smith
smiths
smo
smoke
smoking
smooth
smu
sna
snake
snakes
snow
snowballs
soap
soccer
social
societies
society
sock
socks
sofa
soft
soh
sold
solutions
solve
solved
solving
some
somebody
someone
something
sometime
sometimes
somewhere
son
song
songs
soon
sooner
sorry
sound
sounded
sounds
soup
sour
south
spa
space
spaghett
spaghetti
spaid
spare
spe
speak
speaker
speakers
speaking
speaks
speci
special
specific
sped
speech
speed
speeded
spel
spell
spelled
spelt
spend
spending
spent
sper
spi
spider
spiders
spirit
spirits
spo
spoke
spoken
spoon
spoons
sport
sports
spr
spre
spread
spreading
spred
spring
sqk
square
sru
sta
staff
stail
stamp
stamps
stand
standard
standards
star
stare
stared
staring
stars
start
started
starter
starting
starts
stated
statement
statements
states
station
stationery
stations
stay
stayed
staying
stays
ste
steal
steamboat
steel
steen
step
steps
ster
sterday
stery
steve
sth
sti
stick
stik
still
stin
stju
stli
sto
stoker
stole
stolen
stone
stonehenge
stones
stood
stop
stopped
store
stores
storical
stories
storm
story
stqr
str
straight
strange
strangely
stranger
strangers
strawberries
strawberry
stre
street
streets
streili
streindz
stress
stressed
stri
strict
stro
strong
stronger
strongest
structure
structures
stu
stuck
student
students
studied
studies
study
studying
stupid
stvd
stvk
style
subj
subject
subjects
subordinate
subway
subways
succeed
succeeded
success
successful
such
sudden
suddenly
sue
suf
suffixes
sugar
suggest
suggestion
suggestions
suggests
suit
suitable
summarize
summarizing
summer
sun
sunday
sung
sunny
suns
sunshine
sunville
superhero
superlative
superlatives
supermarket
supermarkets
support
supported
supporting
suppose
supposed
sur
sure
surface
surprise
surprised
survey
susan
svbdzikt
svd
svm
svmb
svn
svndei
svt
swam
sweater
sweaters
sweet
swet
swim
swimming
swing
swiss
swits
switzerland
swum
swung
symbol
symbols
table
tags
tai
taidi
taim
taini
tait
take
takeaway
taken
takes
taking
tal
tale
talent
talented
talents
tales
talk
talked
talking
talks
tall
taller
tallest
tamp
tao
tape
tapes
tapescripts
tara
target
task
tasks
taste
tasted
tastes
taught
taxi
tch
tdei
tea
teach
teacher
teachers
teaches
teaching
teal
team
teammate
teammates
teams
teas
technology
ted
teen
teenage
teenager
teenagers
teeth
teibl
teik
teil
teip
teisn
tekst
tekstbuk
tele
telephone
television
telif
telivizn
tell
telling
tells
temper
temperature
templ
temple
ten
tend
tenis
tennis
tense
tensn
tenth
tention
ter
teresa
term
ternoon
terrible
terrorist
test
tests
text
textbook
texts
tha
thailand
than
thank
thanked
thankful
thanks
thanksgiving
that
the
theater
theaters
theatre
their
theirs
them
theme
themselves
themshe
then
there
these
they
thick
thin
thing
things
think
thinking
thinks
thinly
thinner
thinnest
third
thirs
thirst
thirsty
thirteen
thirteenth
thirtieth
thirty
this
thomas
those
though
thought
thoughts
thousand
thousands
thr
three
threw
thro
through
throw
throwing
thrown
thur
thursday
thursdays
tian
ticket
tickets
tidy
tie
ties
til
till
tim
time
times
tin
tina
ting
tiny
tion
tips
tired
titanic
title
tiv
tiz
tju
tkweik
tle
tli
tod
today
toe
together
toilet
told
tom
tomato
tomatoes
tomorrow
ton
tonight
tons
tony
too
took
toothache
top
topic
topics
total
touch
touched
touches
touching
tourist
tourists
town
towns
toy
toys
tqm
tra
trade
traded
trader
traders
tradition
traditional
train
training
traits
translate
translated
transmitted
transportation
trauz
travel
traveled
traveler
travelers
traveling
travels
tre
treasures
treat
treats
tree
trees
treid
trent
tri
trick
tricked
tricks
tried
tries
trik
trip
trouble
trousers
tru
truck
true
truly
trust
truth
trvk
try
trying
tsa
tsain
tsaini
tse
tsein
tser
tsi
tsikin
tsildr
tsiz
tso
tsois
tsqpst
tsuleit
tue
tuesday
tuesdays
turkey
turn
turned
turning
turns
tvn
twe
twel
twelft
twelfth
twelv
twelve
twenti
twentieth
twenty
twice
twins
two
tyle
type
types
uba
ubail
ubl
uce
udden
udz
uence
uenced
ufo
uggest
ugly
uim
ukei
ukl
uks
uld
ulie
ulin
umbers
umbrella
umm
uncle
uncomfortable
uncountable
uncro
uncrowded
under
underground
underline
underlined
understand
understanding
understood
uneas
uneasy
unexpected
unexpectedly
unfair
unforgettable
unfriendly
unhappiness
unhappy
unhendz
unidentified
uniform
unit
united
units
university
unless
unli
unluckiest
unlucky
unpleasant
until
unusual
upez
upset
upside
urage
ursday
usa
use
used
useful
uses
using
usist
ust
ustka
ustm
usual
usually
utbuk
utl
uts
uvemb
uza
vable
vacation
vacations
vair
valuable
value
valued
van
vedzt
veg
vegetable
vegetables
veggieburger
vei
vening
ver
vera
verb
verbs
vercame
vercome
veri
verslept
very
vgli
vickers
victor
victory
video
videos
vii
viii
vikt
village
villagers
villages
villiers
vin
vince
violin
violinist
vis
visit
visited
visiting
visitor
visitors
vju
vli
vnd
vni
vnikspektid
vnin
vnkl
vnkraud
vnkraudid
vnkvmf
vocabulary
voice
voices
void
volleyball
volleyballs
volunteer
volunteers
vote
vpsaid
vqlibo
wai
waidli
waildeid
wait
waited
waiting
waizli
wake
wakes
walk
walked
walking
walks
wall
wallet
walls
walt
wang
want
wanted
wants
war
warm
warmth
warn
warns
was
wash
washing
washr
washroom
wasn
waste
watch
watched
watches
watching
water
waterfall
watermelon
watermelons
watson
way
ways
wded
weak
wealth
wear
wearing
wears
weather
websait
website
wed
wednesday
wee
week
weekday
weekend
weekends
weekly
weeks
wei
weifang
weight
weit
wel
welcome
weld
welk
well
welles
welt
welz
wen
went
wenty
wenzdei
wer
were
weren
west
western
wet
what
whatever
whe
wheel
when
whenever
where
whether
whi
which
while
whitcomb
white
who
whoever
whole
whom
whose
why
wid
wide
widely
wife
wildaid
wildlife
will
willie
wilson
wimin
win
wind
window
windows
windy
wing
wings
winner
winning
wins
winter
wisely
wished
wishes
wishing
wit
with
without
witk
woke
woken
wolf
woman
women
won
wonder
wonderful
wondering
wonders
wong
wood
wooden
word
words
wore
work
workday
worked
worker
workers
working
works
world
worldwide
worn
worried
worries
worry
worse
worst
worth
would
wouldn
wound
wounds
wow
wqnt
wqsru
wqt
wqts
wri
write
writer
writers
writing
writt
written
wrong
wrote
wudn
wuhan
wulf
wum
wuxi
wvn
wwf
www
xample
xcuse
xes
xia
xiang
xie
xin
xingqing
xun
yang
yeah
year
years
yellow
yes
yesterday
yet
ying
yingyu
yingyue
yiwu
yoghurt
yogurt
york
yoshi
yoshioka
you
young
younger
youngest
your
yours
yourself
yourselves
yuan
yue
yun
yunnan
zdei
zealand
zed
zero
zhang
zhao
zheng
zhuge
zik
zikl
zil
zip
zipper
zippers
zir
zisn
zongzi
zoo
